xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_i2c.h
#define IS_I2C_CLOCK_SPEED(SPEED)                               (((SPEED) > 0U) && ((SPEED) <= 1000000U))

#define IS_I2C_OWN_ADDRESS1(ADDRESS1)                           (((ADDRESS1) & 0xFFFFFC00U) == 0U)

#define IS_I2C_OWN_ADDRESS2(ADDRESS2)                           (((ADDRESS2) & 0xFFFFFF01U) == 0U)

#define IS_I2C_TRANSFER_OPTIONS_REQUEST(REQUEST)                (((REQUEST) == I2C_FIRST_FRAME)              || \
                                                                 ((REQUEST) == I2C_FIRST_AND_NEXT_FRAME)     || \
                                                                 ((REQUEST) == I2C_NEXT_FRAME)               || \
                                                                 ((REQUEST) == I2C_FIRST_AND_LAST_FRAME)     || \
                                                                 ((REQUEST) == I2C_LAST_FRAME)               || \
                                                                 ((REQUEST) == I2C_LAST_FRAME_NO_STOP)       || \
                                                                 IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(REQUEST))

#define IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(REQUEST)          (((REQUEST) == I2C_OTHER_FRAME)     || \
                                                                 ((REQUEST) == I2C_OTHER_AND_LAST_FRAME))

#define IS_I2C_WAKEUP_TIMEOUT_CLK_DIV(__DIV__)                  (((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_128) || \
                                                                 ((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_256) || \
                                                                 ((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_512) || \
                                                                 ((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_1024))   

#define IS_I2C_WAKEUP_TIMEOUT_CNT(__CNT__)                      (((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_2)  || \
                                                                 ((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_8)  || \
                                                                 ((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_32) || \
                                                                 ((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_128))   

#define I2C_CHECK_FLAG(__ISR__, __FLAG__)                       ((((__ISR__) & ((__FLAG__) & I2C_FLAG_MASK)) == ((__FLAG__) & I2C_FLAG_MASK)) ? SET : RESET)
#define I2C_CHECK_IT_SOURCE(__CR1__, __IT__)                    ((((__CR1__) & (__IT__)) == (__IT__)) ? SET : RESET)
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif


#endif /* __PY32L090_HAL_I2C_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
